{"date":"2015-10-24T07:41:03+11:00","group":{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"A collection of error, warning or information messages that result from a system action."}],"group":[{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes. The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"string"}],"linkId":"OperationOutcome.id","question":[{"linkId":"OperationOutcome.id.value","repeats":false,"required":false,"text":"Logical id of this artifact","type":"string"}],"repeats":true,"required":false},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource."}],"linkId":"OperationOutcome.meta","repeats":true,"required":false,"text":"Metadata about the resource"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"uri"}],"linkId":"OperationOutcome.implicitRules","question":[{"linkId":"OperationOutcome.implicitRules.value","repeats":false,"required":false,"text":"A set of rules under which this content was created","type":"string"}],"repeats":true,"required":false},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"The base language in which the resource is written. Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute)."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"code"}],"linkId":"OperationOutcome.language","question":[{"linkId":"OperationOutcome.language.value","repeats":false,"required":false,"text":"language","type":"choice"}],"repeats":true,"required":false},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety. Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative."}],"linkId":"OperationOutcome.text","repeats":true,"required":false,"text":"Text summary of the resource, for human interpretation"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope. This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again."}],"linkId":"OperationOutcome.contained","repeats":true,"required":false,"text":"Contained, inline Resources"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."}],"linkId":"OperationOutcome.extension","repeats":true,"required":false,"text":"Additional Content defined by implementations"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."}],"linkId":"OperationOutcome.modifierExtension","repeats":true,"required":false,"text":"Extensions that cannot be ignored"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"An error, warning or information message that results from a system action."}],"group":[{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"unique id for the element within a resource (for internal references)."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"string"}],"linkId":"OperationOutcome.issue.id","question":[{"linkId":"OperationOutcome.issue.id.value","repeats":false,"required":false,"text":"xml:id (or equivalent in JSON)","type":"string"}],"repeats":true,"required":false},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."}],"linkId":"OperationOutcome.issue.extension","repeats":true,"required":false,"text":"Additional Content defined by implementations"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."}],"linkId":"OperationOutcome.issue.modifierExtension","repeats":true,"required":false,"text":"Extensions that cannot be ignored"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"Indicates whether the issue indicates a variation from successful processing. This is labeled as \"Is Modifier\" because applications should not confuse hints and warnings with errors."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"code"}],"linkId":"OperationOutcome.issue.severity","question":[{"linkId":"OperationOutcome.issue.severity.value","repeats":false,"required":false,"text":"severity","type":"choice"}],"repeats":true,"required":true},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"Describes the type of the issue. The system that creates an OperationOutcome SHALL choose the most applicable code from the IssueType value set, and may additional provide its own code for the error in the details element."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"code"}],"linkId":"OperationOutcome.issue.code","question":[{"linkId":"OperationOutcome.issue.code.value","repeats":false,"required":false,"text":"code","type":"choice"}],"repeats":true,"required":true},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"Additional details about the error. This may be a text description of the error, or a system code that identifies the error. A human readable description of the error issue SHOULD be placed in details.text."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"CodeableConcept"}],"linkId":"OperationOutcome.issue.details","question":[{"linkId":"OperationOutcome.issue.details.coding","repeats":false,"required":false,"text":"code:","type":"open-choice"},{"linkId":"OperationOutcome.issue.details.text","repeats":false,"required":false,"text":"text:","type":"string"}],"repeats":true,"required":false,"text":"Additional details about the error"},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"Additional diagnostic information about the issue.  Typically, this may be a description of how a value is erroneous, or a stack dump to help trace the issue. Typically this field is used to provide troubleshooting information about the error."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"string"}],"linkId":"OperationOutcome.issue.diagnostics","question":[{"linkId":"OperationOutcome.issue.diagnostics.value","repeats":false,"required":false,"text":"Additional diagnostic information about the issue","type":"string"}],"repeats":true,"required":false},{"extension":[{"url":"http://hl7.org/fhir/Profile/questionnaire-extensions#flyover","valueString":"A simple XPath limited to element names, repetition indicators and the default child access that identifies one of the elements in the resource that caused this issue to be raised. The root of the XPath is the resource or bundle that generated OperationOutcome.  Each XPath SHALL resolve to a single node.  The XPath syntax is used whether the referenced instance is expressed in XML or JSON."},{"url":"http://www.healthintersections.com.au/fhir/Profile/metadata#type","valueString":"string"}],"linkId":"OperationOutcome.issue.location","question":[{"linkId":"OperationOutcome.issue.location.value","repeats":false,"required":false,"text":"XPath of element(s) related to issue","type":"string"}],"repeats":true,"required":false}],"linkId":"OperationOutcome.issue","repeats":true,"required":true,"title":"A single issue associated with the action"}],"linkId":"OperationOutcome","repeats":true,"required":false,"text":"Can result from the failure of a REST call or be part of the response message returned from a request message.  If sent with extensions overriding particular issues, might even appear as part of a request message.","title":"Information about the success/failure of an action"},"id":"qs1","identifier":[{"system":"urn:ietf:rfc:3986"}],"publisher":"Health Level Seven International (FHIR Infrastructure)","resourceType":"Questionnaire","status":"draft"}