{
  "resourceType": "Questionnaire",
  "id": "qs1",
  "identifier": [
    {
      "system": "urn:ietf:rfc:3986"
    }
  ],
  "status": "draft",
  "date": "2015-10-24T07:41:03+11:00",
  "publisher": "Health Level Seven International (FHIR Infrastructure)",
  "group": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
        "valueString": "A definition of a FHIR structure. This resource is used to describe the underlying resources, data types defined in FHIR, and also for describing extensions, and constraints on resources and data types."
      }
    ],
    "linkId": "StructureDefinition",
    "title": "Structural Definition",
    "required": true,
    "repeats": false,
    "group": [
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes. The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.id",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.id.value",
            "text": "Logical id of this artifact",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource."
          }
        ],
        "linkId": "StructureDefinition.meta",
        "text": "Metadata about the resource",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However, the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "uri"
          }
        ],
        "linkId": "StructureDefinition.implicitRules",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.implicitRules.value",
            "text": "A set of rules under which this content was created",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The base language in which the resource is written. Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource  Not all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute)."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "StructureDefinition.language",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.language.value",
            "text": "language",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety. Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative."
          }
        ],
        "linkId": "StructureDefinition.text",
        "text": "Text summary of the resource, for human interpretation",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope. This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again."
          }
        ],
        "linkId": "StructureDefinition.contained",
        "text": "Contained, inline Resources",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "May be used to represent additional information that is not part of the basic definition of the resource. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
          }
        ],
        "linkId": "StructureDefinition.extension",
        "text": "Additional Content defined by implementations",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "May be used to represent additional information that is not part of the basic definition of the resource, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
          }
        ],
        "linkId": "StructureDefinition.modifierExtension",
        "text": "Extensions that cannot be ignored",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "An absolute URL that is used to identify this structure definition when it is referenced in a specification, model, design or an instance. This SHALL be a URL, SHOULD be globally unique, and SHOULD be an address at which this structure definition is (or will be) published."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "uri"
          }
        ],
        "linkId": "StructureDefinition.url",
        "required": true,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.url.value",
            "text": "Absolute URL used to reference this StructureDefinition",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Formal identifier that is used to identify this StructureDefinition when it is represented in other formats, or referenced in a specification, model, design or an instance  (should be globally unique OID, UUID, or URI), (if it's not possible to use the literal URI)."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "Identifier"
          }
        ],
        "linkId": "StructureDefinition.identifier",
        "text": "Other identifiers for the StructureDefinition",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.identifier.label",
            "text": "label:",
            "type": "string",
            "required": false,
            "repeats": false
          },
          {
            "linkId": "StructureDefinition.identifier.system",
            "text": "system:",
            "type": "string",
            "required": false,
            "repeats": false
          },
          {
            "linkId": "StructureDefinition.identifier.value",
            "text": "value:",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The identifier that is used to identify this version of the StructureDefinition when it is referenced in a specification, model, design or instance. This is an arbitrary value managed by the StructureDefinition author manually."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.version",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.version.value",
            "text": "Logical id for this version of the StructureDefinition",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A free text natural language name identifying the StructureDefinition. Not expected to be globally unique."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.name",
        "required": true,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.name.value",
            "text": "Informal name for this StructureDefinition",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Defined so that applications can use this name when displaying the value of the extension to the user. Applications don't have to use this name, but can always fall back to it. In the absence of a value for this element, use the name."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.display",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.display.value",
            "text": "Use this name when displaying the value",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The status of the StructureDefinition."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "StructureDefinition.status",
        "required": true,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.status.value",
            "text": "status",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "This StructureDefinition was authored for testing purposes (or education/evaluation/marketing), and is not intended to be used for genuine usage."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "boolean"
          }
        ],
        "linkId": "StructureDefinition.experimental",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.experimental.value",
            "text": "If for testing purposes, not real usage",
            "type": "boolean",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The name of the individual or organization that published the structure definition. Usually an organization, but may be an individual. This item SHOULD be populated unless the information is available from context."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.publisher",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.publisher.value",
            "text": "Name of the publisher (Organization or individual)",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Contacts to assist a user in finding and communicating with the publisher."
          }
        ],
        "linkId": "StructureDefinition.contact",
        "title": "Contact details of the publisher",
        "text": "May be a web site, an email address, a telephone number (tel:), etc.",
        "required": false,
        "repeats": true,
        "group": [
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "unique id for the element within a resource (for internal references)."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.contact.id",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.contact.id.value",
                "text": "xml:id (or equivalent in JSON)",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.contact.extension",
            "text": "Additional Content defined by implementations",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.contact.modifierExtension",
            "text": "Extensions that cannot be ignored",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "The name of an individual to contact regarding the structure definition. If there is no named individual, the telecom is for the organization as a whole."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.contact.name",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.contact.name.value",
                "text": "Name of a individual to contact",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "Contact details for individual (if a name was provided) or the publisher."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "ContactPoint"
              }
            ],
            "linkId": "StructureDefinition.contact.telecom",
            "text": "Contact details for individual or publisher",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.contact.telecom.system",
                "text": "type:",
                "type": "choice",
                "required": false,
                "repeats": false
              },
              {
                "linkId": "StructureDefinition.contact.telecom.value",
                "text": "value:",
                "type": "string",
                "required": false,
                "repeats": false
              },
              {
                "linkId": "StructureDefinition.contact.telecom.use",
                "text": "use:",
                "type": "choice",
                "required": false,
                "repeats": false
              }
            ]
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The date this version of the structure definition was published. The date must change when the business version changes, if it does, and it must change if the status code changes. In addition, it should change when the substantive content of the structure definition changes. Additional specific dates may be added as extensions."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "datetime"
          }
        ],
        "linkId": "StructureDefinition.date",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.date.value",
            "text": "Date for this version of the StructureDefinition",
            "type": "dateTime",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A free text natural language description of the StructureDefinition and its use. This field can be used for things such as why the StructureDefinition was written, comments about misuse, instructions for clinical use and interpretation, literature references, examples from the paper world, etc.  It is *not* a rendering of the StructureDefinition as conveyed in StructureDefinition.text. This item SHOULD be populated unless the information is available from context."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.description",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.description.value",
            "text": "Natural language description of the StructureDefinition",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The content was developed with a focus and intent of supporting the contexts that are listed. These terms may be used to assist with indexing and searching of structure definitions."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "CodeableConcept"
          }
        ],
        "linkId": "StructureDefinition.useContext",
        "text": "Content intends to support these contexts",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.useContext.coding",
            "text": "code:",
            "type": "open-choice",
            "required": false,
            "repeats": false
          },
          {
            "linkId": "StructureDefinition.useContext.text",
            "text": "text:",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Explains why this structure definition is needed and why it's been constrained as it has. This element does not describe the usage of the structure definition (that's done in comments), rather it's for traceability of *why* the element is either needed or why the constraints exist as they do.  This may be used to point to source materials or specifications that drove the structure of this data element."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.requirements",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.requirements.value",
            "text": "Scope and Usage this structure definition is for",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A copyright statement relating to the structure definition and/or its contents. Copyright statements are generally legal restrictions on the use and publishing of the details of the constraints and mappings."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.copyright",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.copyright.value",
            "text": "Use and/or publishing restrictions",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A set of terms from external terminologies that may be used to assist with indexing and searching of templates."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "Coding"
          }
        ],
        "linkId": "StructureDefinition.code",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.code.value",
            "text": "Assist with indexing and finding",
            "type": "open-choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The version of the FHIR specification on which this StructureDefinition is based - this is the formal version of the specification, without the revision number, e.g. [publication].[major].[minor], which is 1.0.2 for this version. A StructureDefinition does not need to specify the target it applies to,as StructureDefinitions will often be valid across multiple versions of FHIR. FHIR tooling can determine whether a StructureDefinition is consistent with a particular StructureDefinition if desired."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.fhirVersion",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.fhirVersion.value",
            "text": "FHIR Version this StructureDefinition targets",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "An external specification that the content is mapped to."
          }
        ],
        "linkId": "StructureDefinition.mapping",
        "title": "External specification that the content is mapped to",
        "required": false,
        "repeats": true,
        "group": [
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "unique id for the element within a resource (for internal references)."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.mapping.id",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.mapping.id.value",
                "text": "xml:id (or equivalent in JSON)",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.mapping.extension",
            "text": "Additional Content defined by implementations",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.mapping.modifierExtension",
            "text": "Extensions that cannot be ignored",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "An Internal id that is used to identify this mapping set when specific mappings are made. The specification is described once, with general comments, and then specific mappings are made that reference this declaration."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.mapping.identity",
            "required": true,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.mapping.identity.value",
                "text": "Internal id when this mapping is used",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "An absolute URI that identifies the specification that this mapping is expressed to. A formal identity for the specification being mapped to helps with identifying maps consistently."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "uri"
              }
            ],
            "linkId": "StructureDefinition.mapping.uri",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.mapping.uri.value",
                "text": "Identifies what this mapping refers to",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "A name for the specification that is being mapped to."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.mapping.name",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.mapping.name.value",
                "text": "Names what this mapping refers to",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "Comments about this mapping, including version notes, issues, scope limitations, and other important notes for usage."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.mapping.comments",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.mapping.comments.value",
                "text": "Versions, Issues, Scope limitations etc.",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Defines the kind of structure that this definition is describing."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "StructureDefinition.kind",
        "required": true,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.kind.value",
            "text": "kind",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The type of type that is being constrained - a data type, an extension, a resource, including abstract ones. If this field is present, it indicates that the structure definition is a constraint. If it is not present, then the structure definition is the definition of a base structure. if a constrained type is present, then there SHALL be a base resource as well. Note that the constrained type could be determined by chasing through the base references until the base definition is reached, or by looking at the path of the first element in the snapshot - if present - but providing the constrainedType directly makes for simpler tooling and indexing."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "StructureDefinition.constrainedType",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.constrainedType.value",
            "text": "constrained type",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Whether structure this definition describes is abstract or not  - that is, whether an actual exchanged item can ever be of this type. Abstract Resources cannot be instantiated - a concrete sub-type must be used. Abstract datatypes and extensions cannot be used in an instance. Flagging a constraint structure as abstract conveys design intent but makes no difference to how the structure definition is handled. Note that inline declared elements that are given the type \"Element\" in the profile, but have children described, are anonymous concrete types that specialise Element. Abstract is not relevant for logical models."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "boolean"
          }
        ],
        "linkId": "StructureDefinition.abstract",
        "required": true,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.abstract.value",
            "text": "Whether the structure is abstract",
            "type": "boolean",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "If this is an extension, Identifies the context within FHIR resources where the extension can be used."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "StructureDefinition.contextType",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.contextType.value",
            "text": "context type",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "Identifies the types of resource or data type elements to which the extension can be applied. If the context is an element that can have multiple types, then use (e.g.) value[x] if the extension works on all choice types, or otherwise an enumeration of explicitly named elements if not. Note that a context of \"string\" doesn't mean that the extension can be used with one of the string patterns such as \"id\" etc."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "StructureDefinition.context",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.context.value",
            "text": "Where the extension can be used in instances",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "An absolute URI that is the base structure from which this set of constraints is derived. If differential constraints are specified in this structure, they are applied to the base in a \"differential\" fashion. If there is no base, then the differential constraints cannot be provided (snapshot only). Differential structures are useful for the editing perspective, and snapshot structures are suitable for operational use. The FHIR Project provides a number of tools/services to populate snapshots from differential constraints. Logical Models have a base of \"Element\" or another logical model."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "uri"
          }
        ],
        "linkId": "StructureDefinition.base",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "StructureDefinition.base.value",
            "text": "Structure that this set of constraints applies to",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A snapshot view is expressed in a stand alone form that can be used and interpreted without considering the base StructureDefinition."
          }
        ],
        "linkId": "StructureDefinition.snapshot",
        "title": "Snapshot view of the structure",
        "required": false,
        "repeats": false,
        "group": [
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "unique id for the element within a resource (for internal references)."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.snapshot.id",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.snapshot.id.value",
                "text": "xml:id (or equivalent in JSON)",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.snapshot.extension",
            "text": "Additional Content defined by implementations",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.snapshot.modifierExtension",
            "text": "Extensions that cannot be ignored",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "Captures constraints on each element within the resource."
              }
            ],
            "linkId": "StructureDefinition.snapshot.element",
            "text": "Definition of elements in the resource (if no StructureDefinition)",
            "required": true,
            "repeats": true
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A differential view is expressed relative to the base StructureDefinition - a statement of differences that it applies."
          }
        ],
        "linkId": "StructureDefinition.differential",
        "title": "Differential view of the structure",
        "required": false,
        "repeats": false,
        "group": [
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "unique id for the element within a resource (for internal references)."
              },
              {
                "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
                "valueString": "string"
              }
            ],
            "linkId": "StructureDefinition.differential.id",
            "required": false,
            "repeats": true,
            "question": [
              {
                "linkId": "StructureDefinition.differential.id.value",
                "text": "xml:id (or equivalent in JSON)",
                "type": "string",
                "required": false,
                "repeats": false
              }
            ]
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element. In order to make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.differential.extension",
            "text": "Additional Content defined by implementations",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "May be used to represent additional information that is not part of the basic definition of the element, and that modifies the understanding of the element that contains it. Usually modifier elements provide negation or qualification. In order to make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions. There can be no stigma associated with the use of extensions by any application, project, or standard - regardless of the institution or jurisdiction that uses or defines the extensions.  The use of extensions is what allows the FHIR specification to retain a core level of simplicity for everyone."
              }
            ],
            "linkId": "StructureDefinition.differential.modifierExtension",
            "text": "Extensions that cannot be ignored",
            "required": false,
            "repeats": true
          },
          {
            "extension": [
              {
                "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
                "valueString": "Captures constraints on each element within the resource."
              }
            ],
            "linkId": "StructureDefinition.differential.element",
            "text": "Definition of elements in the resource (if no StructureDefinition)",
            "required": true,
            "repeats": true
          }
        ]
      }
    ]
  }
}